#+TITLE: Day 2
* Part 1
+ A = X = Rock = 1
+ B = Y = Paper = 2
+ C = Z = Scissors = 3

+ Loss = 0
+ Draw = 3
+ Win = 6

Given the strategy guide, determine the final score.

#+begin_src python
d = {"A":1, "B":2, "C":3, "X":1, "Y":2, "Z":3}

def rps(P1, P2):
    if P1 == P2:
        return P2+3
    if P1 + 1 == P2 or P1 + 1 == P2 + 3:
        return P2+6
    return P2


with open("input.txt") as input:
    score = 0
    lines = 0
    for line in input:
        P1 = d[line[0]]
        P2 = d[line[2]]
        score += rps(P1, P2)
return score


#+end_src

#+RESULTS:
: 13526
* Part 2
+ A = Rock = 1
+ B = Paper = 2
+ C = Scissors = 3

+ Loss = 0 = X
+ Draw = 3 = Y
+ Win = 6 = Z

#+begin_src python
d = {"A":1, "B":2, "C":3, "X":0, "Y":3, "Z":6}

def make_score(s):
    if s > 3:
        s = 1
    if s < 1:
        s = 3
    return s

def rps(P1, P2):
    if P2 == 0:
        score = P1 - 1
    elif P2 == 3:
        score = P1
    else:
        score = P1 + 1
    return make_score(score) + P2

with open("input.txt") as input:
    score = 0
    lines = 0
    for line in input:
        P1 = d[line[0]]
        P2 = d[line[2]]
        score += rps(P1, P2)
return score


#+end_src

#+RESULTS:
: 14204
